Documents/ESB/ESB_Consumer_1016/003TestSample/SAMPLE_XML_MUST/RewardPoints/RP03_RwdPntsXferAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/RewardPoints/RwdPntsXferAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>RewardPoints</ServiceDomain>  
      <OperationName>RwdPntsXferAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:RwdPntsXferAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>RP03</v11:TxnId>  
        <v11:TxnNo>RP0300001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:DbMmbId>1200000001</v11:DbMmbId>  
        <v11:CrMmbId>1200000002</v11:CrMmbId>  
        <!--Optional:-->  
        <v11:DbCustPermId>A123456789</v11:DbCustPermId>  
        <!--Optional:-->  
        <v11:CrCustPermId>A234567891</v11:CrCustPermId>  
        <v11:HdlgChrgFlg>Y</v11:HdlgChrgFlg>  
        <v11:XferPnts>100.0</v11:XferPnts> 
      </v11:ServiceBody> 
    </v11:RwdPntsXferAddRq> 
  </soap:Body> 
</soap:Envelope>
